
​


​


​

​
// =============================================================================
// Задание 7
// =============================================================================
/**
 * Пропущенные буквы
 * Найдите пропущенную букву в диапазоне букв и верните ее.
 */
fearNotLetter('abce'); // "d"
fearNotLetter('abcdefghjklmno'); // "i"
fearNotLetter('stvwx'); // "u"
fearNotLetter('bcdf'); // "e"
fearNotLetter('abcdefghijklmnopqrstuvwxyz'); // undefined
​
// =============================================================================
// Задание 8
// =============================================================================
/**
 * Сумма всех парных чисел
 * Посчитайте сумму всех парных чисел в массиве
 */
sumEvens([1, 2, 3, 4]); // 6
sumEvens([11, 22, 33, 44]); // 66
sumEvens([5, 7, 8, 9]); // 8
sumEvens([1, 3, 5, 7]); // 0
​
// =============================================================================
// Задание 9
// =============================================================================
/**
 * Создайте животного, млекопитающегося и собаки (наследование)
 * Напишите конструкторы Animal, Mammal и Dog
 * которые наследуются друг от друга.
 * Создайте свойства и методы для классов:
 *  Animal - limbs (конечности шт.) - number
 *  Mammal - isMammal (является млекопитающим) - boolean
 *  Dog - bark() (гав-гав) - function
 */
console.log(dog.limbs); // 4
console.log(dog.isMammal); // true
dog.bark(); // гав-гав
​
// =============================================================================
// Задание 10
// =============================================================================
/**
 * Напишите пример замыкания
 * Например счетчик
 */
count(); // 1
count(); // 2
count(); // 3